InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_CHMAP.h
/**
 *
 * @file DMA_RegisterDefines_CHMAP.h
 * @copyright
 * @verbatim InDeviceMex 2020 @endverbatim
 *
 * @par Responsibility
 * @verbatim InDeviceMex Developers @endverbatim
 *
 * @version
 * @verbatim 1.0 @endverbatim
 *
 * @date
 * @verbatim 28 jul. 2020 @endverbatim
 *
 * @author
 * @verbatim vyldram @endverbatim
 *
 * @par Change History
 * @verbatim
 * Date           Author     Version     Description
 * 28 jul. 2020     vyldram    1.0         initial Version@endverbatim
 */
#ifndef XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHMAP_H_
#define XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHMAP_H_

#include <stdint.h>

/**************************************************************************************
************************************* 23 DMACHMAP0 *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMACHMAP0_R_CH0SEL_MASK         ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_R_CH0SEL_BIT          ((uint32_t)0u)
#define DMA_DMACHMAP0_R_CH0SEL_USB0_EP1RX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH0SEL_UART2_RX     ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_R_CH0SEL_SOFTWARE     ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_R_CH0SEL_TIMER4A      ((uint32_t)0x00000003u)

#define DMA_DMACHMAP0_CH0SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH0SEL_USB0_EP1RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH0SEL_UART2_RX       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH0SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH0SEL_TIMER4A        ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH1SEL_MASK         ((uint32_t)0x000000F0u)
#define DMA_DMACHMAP0_R_CH1SEL_BIT          ((uint32_t)4u)
#define DMA_DMACHMAP0_R_CH1SEL_USB0_EP1TX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH1SEL_UART2_TX     ((uint32_t)0x00000010u)
#define DMA_DMACHMAP0_R_CH1SEL_SOFTWARE     ((uint32_t)0x00000020u)
#define DMA_DMACHMAP0_R_CH1SEL_TIMER4B      ((uint32_t)0x00000030u)

#define DMA_DMACHMAP0_CH1SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH1SEL_USB0_EP1TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH1SEL_UART2_TX       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH1SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH1SEL_TIMER4B        ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH2SEL_MASK         ((uint32_t)0x00000F00u)
#define DMA_DMACHMAP0_R_CH2SEL_BIT          ((uint32_t)8u)
#define DMA_DMACHMAP0_R_CH2SEL_USB0_EP2RX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH2SEL_TIMER3A      ((uint32_t)0x00000100u)
#define DMA_DMACHMAP0_R_CH2SEL_SOFTWARE     ((uint32_t)0x00000200u)

#define DMA_DMACHMAP0_CH2SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH2SEL_USB0_EP2RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH2SEL_TIMER3A        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH2SEL_SOFTWARE       ((uint32_t)0x00000002u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH3SEL_MASK         ((uint32_t)0x0000F000u)
#define DMA_DMACHMAP0_R_CH3SEL_BIT          ((uint32_t)12u)
#define DMA_DMACHMAP0_R_CH3SEL_USB0_EP2TX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH3SEL_TIMER3B      ((uint32_t)0x00001000u)
#define DMA_DMACHMAP0_R_CH3SEL_SOFTWARE     ((uint32_t)0x00002000u)

#define DMA_DMACHMAP0_CH3SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH3SEL_USB0_EP2TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH3SEL_TIMER3B        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH3SEL_SOFTWARE       ((uint32_t)0x00000002u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH4SEL_MASK         ((uint32_t)0x000F0000u)
#define DMA_DMACHMAP0_R_CH4SEL_BIT          ((uint32_t)16u)
#define DMA_DMACHMAP0_R_CH4SEL_USB0_EP3RX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH4SEL_TIMER2A      ((uint32_t)0x00010000u)
#define DMA_DMACHMAP0_R_CH4SEL_SOFTWARE     ((uint32_t)0x00020000u)
#define DMA_DMACHMAP0_R_CH4SEL_GPIOA        ((uint32_t)0x00030000u)

#define DMA_DMACHMAP0_CH4SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH4SEL_USB0_EP3RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH4SEL_TIMER2A        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH4SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH4SEL_GPIOA          ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH5SEL_MASK         ((uint32_t)0x00F00000u)
#define DMA_DMACHMAP0_R_CH5SEL_BIT          ((uint32_t)20u)
#define DMA_DMACHMAP0_R_CH5SEL_USB0_EP3TX   ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH5SEL_TIMER2B      ((uint32_t)0x00100000u)
#define DMA_DMACHMAP0_R_CH5SEL_SOFTWARE     ((uint32_t)0x00200000u)
#define DMA_DMACHMAP0_R_CH5SEL_GPIOB        ((uint32_t)0x00300000u)

#define DMA_DMACHMAP0_CH5SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH5SEL_USB0_EP3TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH5SEL_TIMER2B        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH5SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH5SEL_GPIOB          ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH6SEL_MASK         ((uint32_t)0x0F000000u)
#define DMA_DMACHMAP0_R_CH6SEL_BIT          ((uint32_t)24u)
#define DMA_DMACHMAP0_R_CH6SEL_SOFTWARE     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH6SEL_TIMER2A      ((uint32_t)0x01000000u)
#define DMA_DMACHMAP0_R_CH6SEL_UART5_RX     ((uint32_t)0x02000000u)
#define DMA_DMACHMAP0_R_CH6SEL_GPIOC        ((uint32_t)0x03000000u)

#define DMA_DMACHMAP0_CH6SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH6SEL_SOFTWARE       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH6SEL_TIMER2A        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH6SEL_UART5_RX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH6SEL_GPIOC          ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP0_R_CH7SEL_MASK         ((uint32_t)0xF0000000u)
#define DMA_DMACHMAP0_R_CH7SEL_BIT          ((uint32_t)28u)
#define DMA_DMACHMAP0_R_CH7SEL_SOFTWARE     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_R_CH7SEL_TIMER2B      ((uint32_t)0x10000000u)
#define DMA_DMACHMAP0_R_CH7SEL_UART5_TX     ((uint32_t)0x20000000u)
#define DMA_DMACHMAP0_R_CH7SEL_GPIOD        ((uint32_t)0x30000000u)

#define DMA_DMACHMAP0_CH7SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP0_CH7SEL_SOFTWARE       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP0_CH7SEL_TIMER2B        ((uint32_t)0x00000001u)
#define DMA_DMACHMAP0_CH7SEL_UART5_TX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP0_CH7SEL_GPIOD          ((uint32_t)0x00000003u)
/*--------*/

/**************************************************************************************
************************************* 24 DMACHMAP1 *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMACHMAP1_R_CH8SEL_MASK         ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_R_CH8SEL_BIT          ((uint32_t)0u)
#define DMA_DMACHMAP1_R_CH8SEL_UART0_RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH8SEL_UART1_RX     ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_R_CH8SEL_SOFTWARE     ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_R_CH8SEL_TIMER5A      ((uint32_t)0x00000003u)

#define DMA_DMACHMAP1_CH8SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH8SEL_UART0_RX       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH8SEL_UART1_RX       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH8SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH8SEL_TIMER5A        ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH9SEL_MASK         ((uint32_t)0x000000F0u)
#define DMA_DMACHMAP1_R_CH9SEL_BIT          ((uint32_t)4u)
#define DMA_DMACHMAP1_R_CH9SEL_UART0_TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH9SEL_UART1_TX     ((uint32_t)0x00000010u)
#define DMA_DMACHMAP1_R_CH9SEL_SOFTWARE     ((uint32_t)0x00000020u)
#define DMA_DMACHMAP1_R_CH9SEL_TIMER5B      ((uint32_t)0x00000030u)

