InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_CHMAP.h
#define DMA_DMACHMAP1_CH9SEL_MASK           ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH9SEL_UART0_TX       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH9SEL_UART1_TX       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH9SEL_SOFTWARE       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH9SEL_TIMER5B        ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH10SEL_MASK        ((uint32_t)0x00000F00u)
#define DMA_DMACHMAP1_R_CH10SEL_BIT         ((uint32_t)8u)
#define DMA_DMACHMAP1_R_CH10SEL_SSI0_RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH10SEL_SSI1_RX     ((uint32_t)0x00000100u)
#define DMA_DMACHMAP1_R_CH10SEL_UART6_RX    ((uint32_t)0x00000200u)
#define DMA_DMACHMAP1_R_CH10SEL_WTIMER0A    ((uint32_t)0x00000300u)
#define DMA_DMACHMAP1_R_CH10SEL_SOFTWARE    ((uint32_t)0x00000400u)

#define DMA_DMACHMAP1_CH10SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH10SEL_UART0_RX      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH10SEL_UART1_RX      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH10SEL_UART6_RX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH10SEL_WTIMER0A      ((uint32_t)0x00000003u)
#define DMA_DMACHMAP1_CH10SEL_SOFTWARE      ((uint32_t)0x00000004u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH11SEL_MASK        ((uint32_t)0x0000F000u)
#define DMA_DMACHMAP1_R_CH11SEL_BIT         ((uint32_t)12u)
#define DMA_DMACHMAP1_R_CH11SEL_SSI0_TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH11SEL_SSI1_TX     ((uint32_t)0x00001000u)
#define DMA_DMACHMAP1_R_CH11SEL_UART6_TX    ((uint32_t)0x00002000u)
#define DMA_DMACHMAP1_R_CH11SEL_WTIMER0B    ((uint32_t)0x00003000u)
#define DMA_DMACHMAP1_R_CH11SEL_SOFTWARE    ((uint32_t)0x00004000u)

#define DMA_DMACHMAP1_CH11SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH11SEL_UART0_TX      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH11SEL_UART1_TX      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH11SEL_UART6_TX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH11SEL_WTIMER0B      ((uint32_t)0x00000003u)
#define DMA_DMACHMAP1_CH11SEL_SOFTWARE      ((uint32_t)0x00000004u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH12SEL_MASK        ((uint32_t)0x000F0000u)
#define DMA_DMACHMAP1_R_CH12SEL_BIT         ((uint32_t)16u)
#define DMA_DMACHMAP1_R_CH12SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH12SEL_UART2_RX    ((uint32_t)0x00010000u)
#define DMA_DMACHMAP1_R_CH12SEL_SSI2_RX     ((uint32_t)0x00020000u)
#define DMA_DMACHMAP1_R_CH12SEL_WTIMER1A    ((uint32_t)0x00030000u)

#define DMA_DMACHMAP1_CH12SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH12SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH12SEL_UART2_RX      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH12SEL_SSI2_RX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH12SEL_WTIMER1A      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH13SEL_MASK        ((uint32_t)0x00F00000u)
#define DMA_DMACHMAP1_R_CH13SEL_BIT         ((uint32_t)20u)
#define DMA_DMACHMAP1_R_CH13SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH13SEL_UART2_TX    ((uint32_t)0x00100000u)
#define DMA_DMACHMAP1_R_CH13SEL_SSI2_TX     ((uint32_t)0x00200000u)
#define DMA_DMACHMAP1_R_CH13SEL_WTIMER1B    ((uint32_t)0x00300000u)

#define DMA_DMACHMAP1_CH13SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH13SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH13SEL_UART2_TX      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH13SEL_SSI2_TX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH13SEL_WTIMER1B      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH14SEL_MASK        ((uint32_t)0x0F000000u)
#define DMA_DMACHMAP1_R_CH14SEL_BIT         ((uint32_t)24u)
#define DMA_DMACHMAP1_R_CH14SEL_ADC0_SS0    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH14SEL_TIMER2A     ((uint32_t)0x01000000u)
#define DMA_DMACHMAP1_R_CH14SEL_SSI3_RX     ((uint32_t)0x02000000u)
#define DMA_DMACHMAP1_R_CH14SEL_GPIOE       ((uint32_t)0x03000000u)
#define DMA_DMACHMAP1_R_CH14SEL_SOFTWARE    ((uint32_t)0x04000000u)

#define DMA_DMACHMAP1_CH14SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH14SEL_ADC0_SS0      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH14SEL_TIMER2A       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH14SEL_SSI3_RX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH14SEL_GPIOE         ((uint32_t)0x00000003u)
#define DMA_DMACHMAP1_CH14SEL_SOFTWARE      ((uint32_t)0x00000004u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP1_R_CH15SEL_MASK        ((uint32_t)0xF0000000u)
#define DMA_DMACHMAP1_R_CH15SEL_BIT         ((uint32_t)28u)
#define DMA_DMACHMAP1_R_CH15SEL_ADC0_SS1    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_R_CH15SEL_TIMER2B     ((uint32_t)0x10000000u)
#define DMA_DMACHMAP1_R_CH15SEL_SSI3_TX     ((uint32_t)0x20000000u)
#define DMA_DMACHMAP1_R_CH15SEL_GPIOF       ((uint32_t)0x30000000u)
#define DMA_DMACHMAP1_R_CH15SEL_SOFTWARE    ((uint32_t)0x40000000u)

#define DMA_DMACHMAP1_CH15SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP1_CH15SEL_ADC0_SS1      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP1_CH15SEL_TIMER2B       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP1_CH15SEL_SSI3_TX       ((uint32_t)0x00000002u)
#define DMA_DMACHMAP1_CH15SEL_GPIOF         ((uint32_t)0x00000003u)
#define DMA_DMACHMAP1_CH15SEL_SOFTWARE      ((uint32_t)0x00000004u)
/*--------*/

/**************************************************************************************
************************************* 25 DMACHMAP2 *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMACHMAP2_R_CH16SEL_MASK        ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_R_CH16SEL_BIT         ((uint32_t)0u)
#define DMA_DMACHMAP2_R_CH16SEL_ADC0_SS2    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH16SEL_SOFTWARE    ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_R_CH16SEL_UART3_RX    ((uint32_t)0x00000002u)
#define DMA_DMACHMAP2_R_CH16SEL_WTIMER2A    ((uint32_t)0x00000003u)

