InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_CHMAP.h
#define DMA_DMACHMAP2_CH16SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH16SEL_ADC0_SS2      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH16SEL_SOFTWARE      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH16SEL_UART3_RX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP2_CH16SEL_WTIMER2A      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH17SEL_MASK        ((uint32_t)0x000000F0u)
#define DMA_DMACHMAP2_R_CH17SEL_BIT         ((uint32_t)4u)
#define DMA_DMACHMAP2_R_CH17SEL_ADC0_SS3    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH17SEL_SOFTWARE    ((uint32_t)0x00000010u)
#define DMA_DMACHMAP2_R_CH17SEL_UART3_TX    ((uint32_t)0x00000020u)
#define DMA_DMACHMAP2_R_CH17SEL_WTIMER2B    ((uint32_t)0x00000030u)

#define DMA_DMACHMAP2_CH17SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH17SEL_ADC0_SS3      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH17SEL_SOFTWARE      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH17SEL_UART3_TX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP2_CH17SEL_WTIMER2B      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH18SEL_MASK        ((uint32_t)0x00000F00u)
#define DMA_DMACHMAP2_R_CH18SEL_BIT         ((uint32_t)8u)
#define DMA_DMACHMAP2_R_CH18SEL_TIMER0A     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH18SEL_TIMER1A     ((uint32_t)0x00000100u)
#define DMA_DMACHMAP2_R_CH18SEL_UART4_RX    ((uint32_t)0x00000200u)
#define DMA_DMACHMAP2_R_CH18SEL_GPIOB       ((uint32_t)0x00000300u)
#define DMA_DMACHMAP2_R_CH18SEL_SOFTWARE    ((uint32_t)0x00000400u)

#define DMA_DMACHMAP2_CH18SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH18SEL_TIMER0A       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH18SEL_TIMER1A       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH18SEL_UART4_RX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP2_CH18SEL_GPIOB         ((uint32_t)0x00000003u)
#define DMA_DMACHMAP2_CH18SEL_SOFTWARE      ((uint32_t)0x00000004u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH19SEL_MASK        ((uint32_t)0x0000F000u)
#define DMA_DMACHMAP2_R_CH19SEL_BIT         ((uint32_t)12u)
#define DMA_DMACHMAP2_R_CH19SEL_TIMER0B     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH19SEL_TIMER1B     ((uint32_t)0x00001000u)
#define DMA_DMACHMAP2_R_CH19SEL_UART4_TX    ((uint32_t)0x00002000u)
#define DMA_DMACHMAP2_R_CH19SEL_SOFTWARE    ((uint32_t)0x00003000u)

#define DMA_DMACHMAP2_CH19SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH19SEL_TIMER0B       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH19SEL_TIMER1B       ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH19SEL_UART4_TX      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP2_CH19SEL_SOFTWARE      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH20SEL_MASK        ((uint32_t)0x000F0000u)
#define DMA_DMACHMAP2_R_CH20SEL_BIT         ((uint32_t)16u)
#define DMA_DMACHMAP2_R_CH20SEL_TIMER1A     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH20SEL_SOFTWARE    ((uint32_t)0x00010000u)
#define DMA_DMACHMAP2_R_CH20SEL_UART7_RX    ((uint32_t)0x00020000u)

#define DMA_DMACHMAP2_CH20SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH20SEL_TIMER1A       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH20SEL_SOFTWARE      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH20SEL_UART7_RX      ((uint32_t)0x00000002u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH21SEL_MASK        ((uint32_t)0x00F00000u)
#define DMA_DMACHMAP2_R_CH21SEL_BIT         ((uint32_t)20u)
#define DMA_DMACHMAP2_R_CH21SEL_TIMER2A     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH21SEL_SOFTWARE    ((uint32_t)0x00100000u)
#define DMA_DMACHMAP2_R_CH21SEL_UART7_TX    ((uint32_t)0x00200000u)

#define DMA_DMACHMAP2_CH21SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH21SEL_TIMER2A       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH21SEL_SOFTWARE      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP2_CH21SEL_UART7_TX      ((uint32_t)0x00000002u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH22SEL_MASK        ((uint32_t)0x0F000000u)
#define DMA_DMACHMAP2_R_CH22SEL_BIT         ((uint32_t)24u)
#define DMA_DMACHMAP2_R_CH22SEL_UART1_RX    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH22SEL_SOFTWARE    ((uint32_t)0x01000000u)

#define DMA_DMACHMAP2_CH22SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH22SEL_UART1_RX      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH22SEL_SOFTWARE      ((uint32_t)0x00000001u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP2_R_CH23SEL_MASK        ((uint32_t)0xF0000000u)
#define DMA_DMACHMAP2_R_CH23SEL_BIT         ((uint32_t)28u)
#define DMA_DMACHMAP2_R_CH23SEL_UART1_TX    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_R_CH23SEL_SOFTWARE    ((uint32_t)0x10000000u)

#define DMA_DMACHMAP2_CH23SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP2_CH23SEL_UART1_TX      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP2_CH23SEL_SOFTWARE      ((uint32_t)0x00000001u)
/*--------*/


/**************************************************************************************
************************************* 26 DMACHMAP3 *************************************
****************************************************************************************/

/*--------*/
#define DMA_DMACHMAP3_R_CH24SEL_MASK        ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_R_CH24SEL_BIT         ((uint32_t)0u)
#define DMA_DMACHMAP3_R_CH24SEL_SSI1_RX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH24SEL_ADC1_SS0    ((uint32_t)0x00000001u)
#define DMA_DMACHMAP3_R_CH24SEL_SOFTWARE    ((uint32_t)0x00000002u)
#define DMA_DMACHMAP3_R_CH24SEL_WTIMER3A    ((uint32_t)0x00000003u)

#define DMA_DMACHMAP3_CH24SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH24SEL_SSI1_RX       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH24SEL_ADC1_SS0      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP3_CH24SEL_SOFTWARE      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP3_CH24SEL_WTIMER3A      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH25SEL_MASK        ((uint32_t)0x000000F0u)
#define DMA_DMACHMAP3_R_CH25SEL_BIT         ((uint32_t)4u)
#define DMA_DMACHMAP3_R_CH25SEL_SSI1_TX     ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH25SEL_ADC1_SS1    ((uint32_t)0x00000010u)
#define DMA_DMACHMAP3_R_CH25SEL_SOFTWARE    ((uint32_t)0x00000020u)
#define DMA_DMACHMAP3_R_CH25SEL_WTIMER3B    ((uint32_t)0x00000030u)

#define DMA_DMACHMAP3_CH25SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH25SEL_SSI1_TX       ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH25SEL_ADC1_SS1      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP3_CH25SEL_SOFTWARE      ((uint32_t)0x00000002u)
#define DMA_DMACHMAP3_CH25SEL_WTIMER3B      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH26SEL_MASK        ((uint32_t)0x00000F00u)
#define DMA_DMACHMAP3_R_CH26SEL_BIT         ((uint32_t)8u)
#define DMA_DMACHMAP3_R_CH26SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH26SEL_ADC1_SS2    ((uint32_t)0x00000100u)
#define DMA_DMACHMAP3_R_CH26SEL_WTIMER4A    ((uint32_t)0x00000300u)

