InDeviceMex/TM4C123/TM4C123_TIMER/xDriver_MCU/DMA/Header/Peripheral/Register/RegisterDefines/DMA_RegisterDefines_CHMAP.h
#define DMA_DMACHMAP3_CH26SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH26SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH26SEL_ADC1_SS2      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP3_CH26SEL_WTIMER4A      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH27SEL_MASK        ((uint32_t)0x0000F000u)
#define DMA_DMACHMAP3_R_CH27SEL_BIT         ((uint32_t)12u)
#define DMA_DMACHMAP3_R_CH27SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH27SEL_ADC1_SS3    ((uint32_t)0x00001000u)
#define DMA_DMACHMAP3_R_CH27SEL_WTIMER4B    ((uint32_t)0x00003000u)

#define DMA_DMACHMAP3_CH27SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH27SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH27SEL_ADC1_SS3      ((uint32_t)0x00000001u)
#define DMA_DMACHMAP3_CH27SEL_WTIMER4B      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH28SEL_MASK        ((uint32_t)0x000F0000u)
#define DMA_DMACHMAP3_R_CH28SEL_BIT         ((uint32_t)16u)
#define DMA_DMACHMAP3_R_CH28SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH28SEL_WTIMER5A    ((uint32_t)0x00030000u)

#define DMA_DMACHMAP3_CH28SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH28SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH28SEL_WTIMER5A      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH29SEL_MASK        ((uint32_t)0x00F00000u)
#define DMA_DMACHMAP3_R_CH29SEL_BIT         ((uint32_t)20u)
#define DMA_DMACHMAP3_R_CH29SEL_SOFTWARE    ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_R_CH29SEL_WTIMER5B    ((uint32_t)0x00300000u)

#define DMA_DMACHMAP3_CH29SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH29SEL_SOFTWARE      ((uint32_t)0x00000000u)
#define DMA_DMACHMAP3_CH29SEL_WTIMER5B      ((uint32_t)0x00000003u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH30SEL_MASK        ((uint32_t)0x0F000000u)
#define DMA_DMACHMAP3_R_CH30SEL_BIT         ((uint32_t)24u)
#define DMA_DMACHMAP3_R_CH30SEL_SOFTWARE    ((uint32_t)0x00000000u)

#define DMA_DMACHMAP3_CH30SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH30SEL_SOFTWARE      ((uint32_t)0x00000000u)
/*--------*/

/*--------*/
#define DMA_DMACHMAP3_R_CH31SEL_MASK        ((uint32_t)0xF0000000u)
#define DMA_DMACHMAP3_R_CH31SEL_BIT         ((uint32_t)28u)
#define DMA_DMACHMAP3_R_CH31SEL_SOFTWARE    ((uint32_t)0x00000000u)

#define DMA_DMACHMAP3_CH31SEL_MASK          ((uint32_t)0x0000000Fu)
#define DMA_DMACHMAP3_CH31SEL_RESERVED      ((uint32_t)0x00000000u)
/*--------*/

#endif /* XDRIVER_MCU_DRIVER_HEADER_DMA_DMA_PERIPHERAL_DMA_REGISTER_DMA_REGISTERDEFINES_DMA_REGISTERDEFINES_CHMAP_H_ */
